Revit 2027 API
Application.NewFBXExportOptions Method
Creates 3D-Studio Max (FBX) Export options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FBXExportOptions NewFBXExportOptions()
Public Function NewFBXExportOptions As FBXExportOptions
public:
FBXExportOptions^ NewFBXExportOptions()
member NewFBXExportOptions : unit -> FBXExportOptions
Return Value
FBXExportOptions
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace